[
  {
    "title": { "EN": "Encrypt Diary", "TR": "Encrypt Diary" },
    "features": {
      "EN": [
        "Stores personal notes securely with AES based encryption.",
        "Mobile app for both iOS and Android built with React Native & Expo.",
        "Add, read, update, and delete notes easily.",
        "Encryption powered by expo-crypto, accessible only with the correct key.",
        "Minimal and user-friendly interface design."
      ],
      "TR": [
        "Kişisel notları AES tabanlı şifreleme ile güvenli bir şekilde saklar.",
        "React Native & Expo ile geliştirilmiş iOS ve Android için mobil uygulama.",
        "Notları kolayca ekleyin, okuyun, güncelleyin ve silin.",
        "Sadece doğru anahtarla erişilebilen expo-crypto tarafından desteklenen şifreleme.",
        "Minimal ve kullanıcı dostu arayüz tasarımı."
      ]
    },
    "description": {
      "EN": "A secure note taking app with AES encryption, built using React Native & Expo.",
      "TR": "AES şifreleme ile güvenli not tutma uygulaması, React Native & Expo ile geliştirildi."
    },
    "codeLink": "https://github.com/hsemihaktas/EncryptDiary",
    "coverImageFile": "/images/EncryptDiary/Cover.png",
    "imageFiles": [],
    "projectSite": "",
    "url": "/project/encrypt-diary",
    "technologies": ["React Native", "Expo", "expo-crypto", "AES", "Mobile"]
  },
  {
    "title": {
      "EN": "Word Application - Lexicon",
      "TR": "Word Application - Lexicon"
    },
    "features": {
      "EN": [
        "Word translation and synonym display (with MyMemory & Datamuse API).",
        "Add/remove favorites and interactive word learning with game mode.",
        "Built using React Native, Expo, Context API, React Navigation, Material Icons, Axios/Fetch."
      ],
      "TR": [
        "Kelime çeviri ve eşanlamlı gösterimi (MyMemory & Datamuse API ile).",
        "Favorilere ekleme/çıkarma ve oyun moduyla etkileşimli kelime öğrenimi.",
        "React Native, Expo, Context API, React Navigation, Material Icons, Axios/Fetch teknolojileri kullanıldı."
      ]
    },
    "description": {
      "EN": "A mobile app for word translation, synonyms, and interactive learning.",
      "TR": "Kelime çeviri, eşanlamlı ve etkileşimli öğrenim için mobil uygulama."
    },
    "codeLink": "https://github.com/hsemihaktas/Lexicon-WordApplication",
    "coverImageFile": "/images/Lexicon/Cover.png",
    "imageFiles": [],
    "projectSite": "",
    "url": "/project/word-application-lexicon",
    "technologies": ["React Native", "Expo", "MyMemory API", "Datamuse API"]
  },
  {
    "title": { "EN": "FaceRateMax Website", "TR": "FaceRateMax Web Sitesi" },
    "features": {
      "EN": [
        "Showcases the FaceRateMax AI-powered face analysis application.",
        "Built with Next.js and TailwindCSS for a modern and responsive design.",
        "Provides information about the app, which is exclusively available on mobile devices."
      ],
      "TR": [
        "FaceRateMax yapay zeka destekli yüz analizi uygulamasını sergiler.",
        "Modern ve duyarlı bir tasarım için Next.js ve TailwindCSS ile oluşturuldu.",
        "Sadece mobil cihazlarda kullanılabilen uygulama hakkında bilgi sağlar."
      ]
    },
    "description": {
      "EN": "A website for the FaceRateMax app, showcasing its features and providing information for mobile users.",
      "TR": "FaceRateMax uygulaması için bir web sitesi, özelliklerini sergiler ve mobil kullanıcılar için bilgi sağlar."
    },
    "codeLink": "https://github.com/hsemihaktas/FaceRateMax",
    "coverImageFile": "/images/FaceRateMaxWebsite/Cover.png",
    "imageFiles": [],
    "projectSite": "https://face-rate-max.vercel.app/",
    "url": "/project/faceratemax-website",
    "technologies": ["Next.js", "TailwindCSS"]
  },
  {
    "title": { "EN": "TaskFlow", "TR": "TaskFlow" },
    "features": {
      "EN": [
        "Modern task and project management system built with Next.js and TypeScript.",
        "Backend powered by Supabase and PostgreSQL.",
        "Role-based organization structure (Owner, Admin, Member).",
        "Interactive Kanban board with drag-and-drop task management.",
        "Real-time updates through optimized polling.",
        "Clean, responsive, and user-friendly UI design."
      ],
      "TR": [
        "Next.js ve TypeScript ile geliştirilmiş modern görev ve proje yönetim sistemi.",
        "Supabase ve PostgreSQL ile desteklenen backend altyapısı.",
        "Rol tabanlı organizasyon yapısı (Owner, Admin, Member).",
        "Sürükle-bırak destekli interaktif Kanban görev tahtası.",
        "Optimize edilmiş polling yöntemiyle gerçek zamanlı güncellemeler.",
        "Temiz, duyarlı ve kullanıcı dostu arayüz tasarımı."
      ]
    },
    "description": {
      "EN": "A modern and secure task management system built with Next.js, Supabase, and TypeScript.",
      "TR": "Next.js, Supabase ve TypeScript kullanılarak geliştirilmiş modern ve güvenli bir görev yönetim sistemi."
    },
    "codeLink": "https://github.com/hsemihaktas/TaskFlow",
    "coverImageFile": "/images/TaskFlow/Cover.png",
    "imageFiles": [],
    "projectSite": "https://demo-taskflow.vercel.app/",
    "url": "/project/taskflow",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Supabase",
      "PostgreSQL",
      "TailwindCSS",
      "Kanban"
    ]
  },
  {
    "title": {
      "EN": "E-Commerce Platform",
      "TR": "E-Ticaret Platformu"
    },
    "features": {
      "EN": [
        "Developed a comprehensive multi-vendor e-commerce platform where users can create their own stores and sell products.",
        "Implemented secure user authentication and store management system with Firebase Authentication and Firestore.",
        "Built a complete dashboard with real-time analytics, product management, order tracking, and financial reporting.",
        "Created responsive design optimized for all devices with modern UI/UX using Tailwind CSS.",
        "Developed shopping cart functionality, order processing, and store customization features.",
        "Implemented real-time inventory tracking, low stock alerts, and automated stock management.",
        "Built custom modal system replacing browser alerts for better user experience.",
        "Added phone number formatting for Turkish users and comprehensive form validation."
      ],
      "TR": [
        "Kullanıcıların kendi mağazalarını oluşturabildiği ve ürün satabildikleri kapsamlı çok-satıcılı e-ticaret platformu geliştirdim.",
        "Firebase Authentication ve Firestore ile güvenli kullanıcı kimlik doğrulama ve mağaza yönetim sistemi uyguladım.",
        "Gerçek zamanlı analitikler, ürün yönetimi, sipariş takibi ve finansal raporlama ile eksiksiz bir dashboard oluşturdum.",
        "Tailwind CSS kullanarak modern UI/UX ile tüm cihazlar için optimize edilmiş responsive tasarım geliştirdim.",
        "Alışveriş sepeti işlevselliği, sipariş işleme ve mağaza özelleştirme özelliklerini geliştirdim.",
        "Gerçek zamanlı envanter takibi, düşük stok uyarıları ve otomatik stok yönetimi uyguladım.",
        "Daha iyi kullanıcı deneyimi için browser alertlerinin yerini alan özel modal sistemi oluşturdum.",
        "Türk kullanıcıları için telefon numarası formatlaması ve kapsamlı form doğrulama ekledim."
      ]
    },
    "description": {
      "EN": "A full-stack e-commerce platform with Next.js and Firebase, allowing users to create stores, manage products, and track orders.",
      "TR": "Next.js ve Firebase ile geliştirilmiş, kullanıcıların mağaza oluşturup ürün ve sipariş yönetimi yapabildiği tam kapsamlı bir e-ticaret platformu."
    },
    "codeLink": "https://github.com/hsemihaktas/E-Commerce-Website",
    "coverImageFile": "/images/E-Commerce/Cover.png",
    "imageFiles": [],
    "projectSite": "https://demo-e-ticaret.vercel.app/",
    "url": "/project/ecommerce-platform",
    "technologies": [
      "Next.js",
      "TypeScript",
      "Firebase",
      "Firebase Authentication",
      "Firestore",
      "TailwindCSS",
      "React"
    ]
  },
  {
    "title": { "EN": "IMDB Series Tierlist", "TR": "IMDB Dizi Tier Listesi" },
    "features": {
      "EN": [
        "A web application to rank TV series based on IMDB ratings.",
        "Built using React.js and TailwindCSS for a responsive and visually appealing interface.",
        "Features drag and drop functionality for creating tier lists.",
        "Data fetched using a Python script based scraper for IMDB series data."
      ],
      "TR": [
        "IMDB puanlarına göre dizileri sıralamak için bir web uygulaması.",
        "React.js ve TailwindCSS kullanılarak duyarlı ve görsel olarak çekici bir arayüz oluşturuldu.",
        "Tier listeleri oluşturmak için sürükle bırak işlevselliği içerir.",
        "IMDB dizi verilerini almak için Python script tabanlı bir scraper kullanıldı."
      ]
    },
    "description": {
      "EN": "A web app for ranking TV series with drag-and-drop functionality and data fetched via Python scraper.",
      "TR": "Sürükle bırak işlevselliği ve Python scraper ile veri çekme özellikli dizi sıralama web uygulaması."
    },
    "codeLink": "https://github.com/hsemihaktas/IMDB-Series-Tierlist",
    "coverImageFile": "/images/IMDBTierlist/Cover.jpeg",
    "imageFiles": [],
    "projectSite": "https://imdb-series-tierlist.vercel.app/",
    "url": "/project/imdb-series-tierlist",
    "technologies": [
      "ReactJS",
      "TailwindCSS",
      "Python",
      "Web Scraping",
      "JavaScript"
    ]
  },
  {
    "title": {
      "EN": "Gaming Website",
      "TR": "Oyun Web Sitesi"
    },
    "features": {
      "EN": [
        "Designed and developed a modern gaming website to showcase front-end skills.",
        "Implemented dynamic game pages with mock data, including story, gameplay, features, and media gallery.",
        "Created a fully responsive design optimized for desktop and mobile devices.",
        "Enhanced user experience with interactive UI elements such as hover effects and animations.",
        "Utilized Next.js for dynamic routing and server-side rendering."
      ],
      "TR": [
        "Front-end becerilerini sergilemek için modern bir oyun web sitesi tasarladım ve geliştirdim.",
        "Hikaye, oynanış, özellikler ve medya galerisi gibi bölümleri içeren, mock verilerle çalışan dinamik oyun sayfaları oluşturdum.",
        "Masaüstü ve mobil cihazlar için optimize edilmiş tamamen duyarlı bir tasarım geliştirdim.",
        "Hover efektleri ve animasyonlar gibi etkileşimli UI öğeleriyle kullanıcı deneyimini geliştirdim.",
        "Dinamik yönlendirme ve sunucu tarafı render için Next.js kullandım."
      ]
    },
    "description": {
      "EN": "A front-end focused gaming website built with Next.js to demonstrate design and development skills using mock data.",
      "TR": "Mock veriler kullanarak tasarım ve geliştirme becerilerini sergilemek için Next.js ile inşa edilmiş front-end odaklı bir oyun web sitesi."
    },
    "codeLink": "https://github.com/hsemihaktas/Gaming-Website",
    "coverImageFile": "/images/GamingWebsite/Cover.png",
    "imageFiles": [],
    "projectSite": "https://hgamepulse.vercel.app/",
    "url": "/project/gaming-website",
    "technologies": ["Next.js", "ReactJS", "JavaScript", "TailwindCSS"]
  },
  {
    "title": { "EN": "Property Website", "TR": "Emlak Web Sitesi" },
    "features": {
      "EN": [
        "Developed a full stack web application for property management using React.js, Node.js, and MySQL.",
        "Successfully managed listing operations through efficient CRUD operations."
      ],
      "TR": [
        "React.js, Node.js ve MySQL kullanarak mülk yönetimi için bir tam yığın web uygulaması geliştirdim.",
        "CRUD işlemleri sayesinde ilan işlemlerini sorunsuz bir şekilde gerçekleştirdim."
      ]
    },
    "description": {
      "EN": "A platform for managing property listings with secure authentication, built using React, Node.js, and MySQL.",
      "TR": "React, Node.js ve MySQL kullanılarak inşa edilen, güvenli kimlik doğrulama ile emlak listelemelerini yönetmek için bir platform."
    },
    "codeLink": "https://github.com/hsemihaktas/EstateWebsite",
    "coverImageFile": "/images/Estate/Cover.png",
    "imageFiles": [],
    "projectSite": "",
    "url": "/project/property-website",
    "technologies": ["ReactJS", "NodeJS", "MySQL", "JavaScript", "TailwindCSS"]
  },
  {
    "title": {
      "EN": "Birthday Organization Website",
      "TR": "Doğum Günü Organizasyon Web Sitesi"
    },
    "features": {
      "EN": [
        "Developed a vibrant and user friendly website for birthday party planning.",
        "Built with Next.js and integrated EmailJS for seamless contact form functionality.",
        "Offers customized birthday packages and online reservation features to enhance user engagement and booking experience."
      ],
      "TR": [
        "Doğum günü partisi planlaması için canlı ve kullanıcı dostu bir web sitesi geliştirdim.",
        "İletişim formu işlevselliği için EmailJS entegrasyonu ile Next.js kullanılarak oluşturuldu.",
        "Kullanıcı etkileşimini ve rezervasyon deneyimini artırmak amacıyla kişiye özel doğum günü paketleri ve online rezervasyon özellikleri sunar."
      ]
    },
    "description": {
      "EN": "A birthday party organization website with online reservation and contact form via EmailJS.",
      "TR": "EmailJS ile iletişim formu ve online rezervasyon özellikli doğum günü organizasyon web sitesi."
    },
    "codeLink": "https://github.com/hsemihaktas/Birthday-Organization",
    "coverImageFile": "/images/Organization/Cover.jpeg",
    "imageFiles": [],
    "projectSite": "https://birthday-organization.vercel.app/",
    "url": "/project/birthday-organization",
    "technologies": ["NextJS", "TailwindCSS", "HTML5", "CSS3", "JavaScript"]
  },
  {
    "title": { "EN": "Riot Twitch Bot", "TR": "Riot Twitch Botu" },
    "features": {
      "EN": [
        "Designed and developed a Twitch chatbot using Node.js and Axios to access the Riot Games API.",
        "Provided viewers with real time game data for League of Legends and Teamfight Tactics, enhancing interaction during Twitch streams.",
        "Integrated the Twitch API for seamless communication with the chat system, enabling immediate responses to viewer queries.",
        "Focused on optimizing API calls to ensure reliable and up to date data retrieval."
      ],
      "TR": [
        "Node.js ve Axios kullanarak Riot Games API'sine erişim sağlayan bir Twitch chatbot'u tasarladım ve geliştirdim.",
        "Twitch yayınları sırasında izleyicilerle etkileşimi artırarak, League of Legends ve Teamfight Tactics için gerçek zamanlı oyun verileri sağladım.",
        "Twitch API'sini entegre ederek sohbet sistemiyle sorunsuz iletişim sağladım ve izleyicilerin sorgularına anında yanıt verdim.",
        "API çağrılarını optimize ederek güvenilir ve güncel veri alımını sağladım."
      ]
    },
    "description": {
      "EN": "A Twitch bot that provides live game stats for League of Legends and Teamfight Tactics using Riot API.",
      "TR": "Riot API'sini kullanarak, League of Legends ve Teamfight Tactics için canlı oyun istatistikleri sağlayan bir Twitch botu."
    },
    "codeLink": "https://github.com/hsemihaktas/RiotTwitchBot",
    "coverImageFile": "/images/RiotBot/Cover.png",
    "imageFiles": [],
    "projectSite": "",
    "url": "/project/riot-twitch-bot",
    "technologies": ["NodeJS", "JavaScript"]
  },
  {
    "title": {
      "EN": "Riot Twitch Bot Website",
      "TR": "Riot Twitch Botu Web Sitesi"
    },
    "features": {
      "EN": [
        "Created a dedicated website to showcase the Riot Twitch Bot project, enhancing its visibility and engagement.",
        "Built with React.js, HTML5, and CSS3 to provide a visually appealing and responsive design.",
        "Included interactive elements to help users explore and understand the features of the Riot Twitch Bot, fostering community interest and participation."
      ],
      "TR": [
        "Riot Twitch Botu projesini sergilemek için özel bir web sitesi oluşturduk, görünürlüğünü ve etkileşimini artırdık.",
        "React.js, HTML5 ve CSS3 ile görsel olarak çekici ve duyarlı bir tasarım sundum.",
        "Kullanıcıların Riot Twitch Botu'nun özelliklerini keşfetmesine yardımcı olacak etkileşimli öğeler ekledim, topluluk ilgisini ve katılımını teşvik ettim."
      ]
    },
    "description": {
      "EN": "A showcase website for the Riot Twitch Bot project, featuring interactive elements and responsive design.",
      "TR": "Riot Twitch Botu projesi için etkileşimli öğeler ve duyarlı tasarım içeren bir sergileme web sitesi."
    },
    "codeLink": "https://github.com/hsemihaktas/RiotTwitchBotWebsite",
    "coverImageFile": "/images/RiotBotWebsite/Cover.png",
    "imageFiles": [],
    "projectSite": "https://riottwitchbot.vercel.app/",
    "url": "/project/riot-twitch-bot-website",
    "technologies": ["ReactJS", "HTML5", "CSS3", "JavaScript", "JSON"]
  },
  {
    "title": { "EN": "BlurFace", "TR": "BlurFace" },
    "features": {
      "EN": [
        "An AI-powered face blurring application for privacy protection.",
        "Built with Python and OpenCV for real-time face detection and blurring.",
        "Supports both image and video processing.",
        "User-friendly interface for selecting blur intensity and regions."
      ],
      "TR": [
        "Gizlilik koruması için yapay zeka destekli yüz bulanıklaştırma uygulaması.",
        "Gerçek zamanlı yüz algılama ve bulanıklaştırma için Python ve OpenCV ile geliştirildi.",
        "Hem görüntü hem de video işleme desteği sunar.",
        "Bulanıklık yoğunluğu ve bölgelerini seçmek için kullanıcı dostu bir arayüz."
      ]
    },
    "description": {
      "EN": "An AI-powered application for face blurring in images and videos, built with Python and OpenCV.",
      "TR": "Python ve OpenCV ile geliştirilen, görüntü ve videolarda yüz bulanıklaştırma için yapay zeka destekli bir uygulama."
    },
    "codeLink": "https://github.com/hsemihaktas/BlurryFace",
    "coverImageFile": "/images/BlurFace/Cover.png",
    "imageFiles": [],
    "projectSite": "",
    "url": "/project/blurryface",
    "technologies": ["Django", "Python", "OpenCV", "AI", "Computer Vision"]
  }
]
